tap "1password/tap"
tap "aquasecurity/trivy"
tap "cloudfoundry/tap"
tap "dagger/tap"
tap "homebrew/bundle"
tap "iann0036/iamlive"
brew "ack"
brew "act"
brew "argocd"
brew "autoconf"
brew "autoenv"
brew "aws-iam-authenticator"
brew "aws-rotate-key"
brew "readline"
brew "aws-sam-cli"
brew "python@3.12"
brew "awscli"
brew "azure-cli"
brew "bats-core"
brew "colima"
brew "cowsay"
brew "curl"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "eksctl"
brew "flake8"
brew "gcc"
brew "geoip"
brew "gh"
brew "git"
brew "gnu-getopt"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "grep"
brew "grpcurl"
brew "grype"
brew "helm"
brew "htop"
brew "httpie"
brew "istioctl"
brew "jq"
brew "k9s"
brew "kind"
brew "kops"
brew "krew"
brew "lolcat"
brew "minikube"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "pipenv"
brew "pipx"
brew "pkgconf"
brew "poetry"
brew "powerlevel10k"
brew "protobuf"
brew "pwgen"
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "sl"
brew "speedtest-cli"
brew "tailscale"
brew "terraform-docs"
brew "terragrunt"
brew "tfenv"
brew "tflint"
brew "thefuck"
brew "tldr"
brew "tofuenv"
brew "tree"
brew "uwsgi"
brew "vault"
brew "virtualenv"
brew "wget"
brew "yamllint"
brew "yq"
brew "aquasecurity/trivy/trivy"
brew "cloudfoundry/tap/cf-cli@8"
brew "dagger/tap/dagger"
brew "iann0036/iamlive/iamlive"
cask "1password"
cask "1password-cli"
cask "firefox"
cask "google-chrome"
cask "little-snitch"
cask "obsidian"
cask "openlens"
cask "postman"
cask "skitch"
cask "slack"
cask "sublime-text"
cask "tofu"
cask "visual-studio-code"
cask "zoom"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "arjun.swagger-viewer"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "circleci.circleci"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.next-js"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "kevinrose.vsc-python-indent"
vscode "magicstack.magicpython"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tailscale.vscode-tailscale"
vscode "timonwong.shellcheck"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
vscode "zainchen.json"
vscode "ziyasal.vscode-open-in-github"
