tap "iann0036/iamlive"
brew "ack"
brew "act"
brew "readline"
brew "python@3.13"
brew "ansible"
brew "ansible-lint"
brew "argocd"
brew "arp-scan"
brew "atuin"
brew "autoconf"
brew "autoenv"
brew "aws-iam-authenticator"
brew "aws-rotate-key"
brew "aws-sam-cli"
brew "aws-vault"
brew "awscli"
brew "python@3.12"
brew "azure-cli"
brew "bat"
brew "bats-core"
brew "btop"
brew "cheat"
brew "cmatrix"
brew "go"
brew "cobra-cli"
brew "colima"
brew "cowsay"
brew "crane"
brew "curl"
brew "dagger"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "dust"
brew "eksctl"
brew "eza"
brew "fastfetch"
brew "fd"
brew "figlet"
brew "flake8"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "gnu-getopt"
brew "gnupg"
brew "golangci-lint"
brew "gping"
brew "grep"
brew "grpcurl"
brew "grype"
brew "helm"
brew "helm-docs"
brew "htop"
brew "httpie"
brew "istioctl"
brew "jq"
brew "k3d"
brew "k9s"
brew "keychain"
brew "kind"
brew "kops"
brew "krew"
brew "kubeseal"
brew "lazydocker"
brew "lazygit"
brew "lolcat"
brew "minikube"
brew "mkcert"
brew "neovim"
brew "nmap"
brew "node"
brew "ollama", restart_service: :changed
brew "opentofu"
brew "pipes-sh"
brew "pkgconf"
brew "poetry"
brew "powerlevel10k"
brew "pre-commit"
brew "procs"
brew "protobuf"
brew "pwgen"
brew "pyenv"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "sl"
brew "speedtest-cli"
brew "tailscale"
brew "tenv"
brew "terraform-docs"
brew "terragrunt"
brew "tflint"
brew "thefuck"
brew "tlrc"
brew "tree"
brew "trivy"
brew "uv"
brew "uwsgi"
brew "websocat"
brew "wget"
brew "wtfutil"
brew "yamllint"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "iann0036/iamlive/iamlive"
cask "1password"
cask "1password-cli"
cask "cursor"
cask "firefox"
cask "google-chrome"
cask "macfuse"
cask "ngrok"
cask "obsidian"
cask "ollama"
cask "openlens"
cask "postman"
cask "shottr"
cask "signal"
cask "slack"
cask "sublime-text"
cask "tofu"
cask "visual-studio-code"
cask "zoom"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "arjun.swagger-viewer"
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "circleci.circleci"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.next-js"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "kevinrose.vsc-python-indent"
vscode "magicstack.magicpython"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tailscale.vscode-tailscale"
vscode "timonwong.shellcheck"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
vscode "zainchen.json"
vscode "ziyasal.vscode-open-in-github"
vscode "zxh404.vscode-proto3"
